MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33EP16GS506/mcu.h
#define ADTRIG3H ADTRIG3H
extern volatile uint16_t ADTRIG3H __attribute__((__sfr__));
__extension__ typedef struct tagADTRIG3HBITS {
  union {
    struct {
      uint16_t TRGSRC14:5;
      uint16_t :3;
      uint16_t TRGSRC15:5;
    };
    struct {
      uint16_t TRIGSRC140:1;
      uint16_t TRIGSRC141:1;
      uint16_t TRIGSRC142:1;
      uint16_t TRIGSRC143:1;
      uint16_t TRIGSRC144:1;
      uint16_t :3;
      uint16_t TRGSRC150:1;
      uint16_t TRGSRC151:1;
      uint16_t TRGSRC152:1;
      uint16_t TRGSRC153:1;
      uint16_t TRGSRC154:1;
    };
    struct {
      uint16_t TRGSRC140:1;
      uint16_t TRGSRC141:1;
      uint16_t TRGSRC142:1;
      uint16_t TRGSRC143:1;
      uint16_t TRGSRC144:1;
    };
  };
} ADTRIG3HBITS;
extern volatile ADTRIG3HBITS ADTRIG3Hbits __attribute__((__sfr__));

#define ADTRIG4L ADTRIG4L
extern volatile uint16_t ADTRIG4L __attribute__((__sfr__));
__extension__ typedef struct tagADTRIG4LBITS {
  union {
    struct {
      uint16_t TRGSRC16:5;
      uint16_t :3;
      uint16_t TRGSRC17:5;
    };
    struct {
      uint16_t TRIGSRC160:1;
      uint16_t TRIGSRC161:1;
      uint16_t TRIGSRC162:1;
      uint16_t TRIGSRC163:1;
      uint16_t TRIGSRC164:1;
      uint16_t :3;
      uint16_t TRGSRC170:1;
      uint16_t TRGSRC171:1;
      uint16_t TRGSRC172:1;
      uint16_t TRGSRC173:1;
      uint16_t TRGSRC174:1;
    };
    struct {
      uint16_t TRGSRC160:1;
      uint16_t TRGSRC161:1;
      uint16_t TRGSRC162:1;
      uint16_t TRGSRC163:1;
      uint16_t TRGSRC164:1;
    };
  };
} ADTRIG4LBITS;
extern volatile ADTRIG4LBITS ADTRIG4Lbits __attribute__((__sfr__));

#define ADTRIG4H ADTRIG4H
extern volatile uint16_t ADTRIG4H __attribute__((__sfr__));
__extension__ typedef struct tagADTRIG4HBITS {
  union {
    struct {
      uint16_t TRGSRC18:5;
      uint16_t :3;
      uint16_t TRGSRC19:5;
    };
    struct {
      uint16_t TRIGSRC180:1;
      uint16_t TRIGSRC181:1;
      uint16_t TRIGSRC182:1;
      uint16_t TRIGSRC183:1;
      uint16_t TRIGSRC184:1;
      uint16_t :3;
      uint16_t TRGSRC190:1;
      uint16_t TRGSRC191:1;
      uint16_t TRGSRC192:1;
      uint16_t TRGSRC193:1;
      uint16_t TRGSRC194:1;
    };
    struct {
      uint16_t TRGSRC180:1;
      uint16_t TRGSRC181:1;
      uint16_t TRGSRC182:1;
      uint16_t TRGSRC183:1;
      uint16_t TRGSRC184:1;
    };
  };
} ADTRIG4HBITS;
extern volatile ADTRIG4HBITS ADTRIG4Hbits __attribute__((__sfr__));

#define ADTRIG5L ADTRIG5L
extern volatile uint16_t ADTRIG5L __attribute__((__sfr__));
__extension__ typedef struct tagADTRIG5LBITS {
  union {
    struct {
      uint16_t TRGSRC20:5;
      uint16_t :3;
      uint16_t TRGSRC21:5;
    };
    struct {
      uint16_t TRIGSRC200:1;
      uint16_t TRIGSRC201:1;
      uint16_t TRIGSRC202:1;
      uint16_t TRIGSRC203:1;
      uint16_t TRIGSRC204:1;
      uint16_t :3;
      uint16_t TRGSRC210:1;
      uint16_t TRGSRC211:1;
      uint16_t TRGSRC212:1;
      uint16_t TRGSRC213:1;
      uint16_t TRGSRC214:1;
    };
    struct {
      uint16_t TRGSRC200:1;
      uint16_t TRGSRC201:1;
      uint16_t TRGSRC202:1;
      uint16_t TRGSRC203:1;
      uint16_t TRGSRC204:1;
    };
  };
} ADTRIG5LBITS;
extern volatile ADTRIG5LBITS ADTRIG5Lbits __attribute__((__sfr__));

#define ADCMP0CON ADCMP0CON
extern volatile uint16_t ADCMP0CON __attribute__((__sfr__));
__extension__ typedef struct tagADCMP0CONBITS {
  union {
    struct {
      uint16_t LOLO:1;
      uint16_t LOHI:1;
      uint16_t HILO:1;
      uint16_t HIHI:1;
      uint16_t BTWN:1;
      uint16_t STAT:1;
      uint16_t IE:1;
      uint16_t CMPEN:1;
      uint16_t CHNL:5;
    };
    struct {
      uint16_t :8;
      uint16_t CHNL0:1;
      uint16_t CHNL1:1;
      uint16_t CHNL2:1;
      uint16_t CHNL3:1;
      uint16_t CHNL4:1;
    };
  };
} ADCMP0CONBITS;
extern volatile ADCMP0CONBITS ADCMP0CONbits __attribute__((__sfr__));

#define ADCMP1CON ADCMP1CON
extern volatile uint16_t ADCMP1CON __attribute__((__sfr__));
__extension__ typedef struct tagADCMP1CONBITS {
  union {
    struct {
      uint16_t LOLO:1;
      uint16_t LOHI:1;
      uint16_t HILO:1;
      uint16_t HIHI:1;
      uint16_t BTWN:1;
      uint16_t STAT:1;
      uint16_t IE:1;
      uint16_t CMPEN:1;
      uint16_t CHNL:5;
    };
    struct {
      uint16_t :8;
      uint16_t CHNL0:1;
      uint16_t CHNL1:1;
      uint16_t CHNL2:1;
      uint16_t CHNL3:1;
      uint16_t CHNL4:1;
    };
  };
} ADCMP1CONBITS;
extern volatile ADCMP1CONBITS ADCMP1CONbits __attribute__((__sfr__));

#define ADLVLTRGL ADLVLTRGL
extern volatile uint16_t ADLVLTRGL __attribute__((__sfr__));
typedef struct tagADLVLTRGLBITS {
  uint16_t LVLEN0:1;
  uint16_t LVLEN1:1;
  uint16_t LVLEN2:1;
  uint16_t LVLEN3:1;
  uint16_t LVLEN4:1;
  uint16_t LVLEN5:1;
  uint16_t LVLEN6:1;
  uint16_t LVLEN7:1;
  uint16_t LVLEN8:1;
  uint16_t LVLEN9:1;
  uint16_t LVLEN10:1;
  uint16_t LVLEN11:1;
  uint16_t LVLEN12:1;
  uint16_t LVLEN13:1;
  uint16_t LVLEN14:1;
  uint16_t LVLEN15:1;
} ADLVLTRGLBITS;
extern volatile ADLVLTRGLBITS ADLVLTRGLbits __attribute__((__sfr__));

#define ADLVLTRGH ADLVLTRGH
extern volatile uint16_t ADLVLTRGH __attribute__((__sfr__));
typedef struct tagADLVLTRGHBITS {
  uint16_t LVLEN16:1;
  uint16_t LVLEN17:1;
  uint16_t LVLEN18:1;
  uint16_t LVLEN19:1;
  uint16_t LVLEN20:1;
  uint16_t LVLEN21:1;
} ADLVLTRGHBITS;
extern volatile ADLVLTRGHBITS ADLVLTRGHbits __attribute__((__sfr__));

#define ADCORE0L ADCORE0L
extern volatile uint16_t ADCORE0L __attribute__((__sfr__));
__extension__ typedef struct tagADCORE0LBITS {
  union {
    struct {
      uint16_t SAMC:10;
    };
    struct {
      uint16_t SAMC0:1;
      uint16_t SAMC1:1;
      uint16_t SAMC2:1;
      uint16_t SAMC3:1;
      uint16_t SAMC4:1;
      uint16_t SAMC5:1;
      uint16_t SAMC6:1;
      uint16_t SAMC7:1;
      uint16_t SAMC8:1;
      uint16_t SAMC9:1;
    };
  };
} ADCORE0LBITS;
extern volatile ADCORE0LBITS ADCORE0Lbits __attribute__((__sfr__));

#define ADCORE0H ADCORE0H
extern volatile uint16_t ADCORE0H __attribute__((__sfr__));
__extension__ typedef struct tagADCORE0HBITS {
  union {
    struct {
      uint16_t ADCS:7;
      uint16_t :1;
      uint16_t RES:2;
      uint16_t EISEL:3;
    };
    struct {
      uint16_t ADCS0:1;
      uint16_t ADCS1:1;
      uint16_t ADCS2:1;
      uint16_t ADCS3:1;
      uint16_t ADCS4:1;
      uint16_t ADCS5:1;
      uint16_t ADCS6:1;
      uint16_t :1;
      uint16_t RES0:1;
      uint16_t RES1:1;
      uint16_t EISEL0:1;
      uint16_t EISEL1:1;
      uint16_t EISEL2:1;
    };
  };
} ADCORE0HBITS;
extern volatile ADCORE0HBITS ADCORE0Hbits __attribute__((__sfr__));

