MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33EP16GS506/mcu.h
/* U1STA */
#define _URXDA U1STAbits.URXDA
#define _OERR U1STAbits.OERR
#define _FERR U1STAbits.FERR
#define _PERR U1STAbits.PERR
#define _RIDLE U1STAbits.RIDLE
#define _ADDEN U1STAbits.ADDEN
#define _URXISEL U1STAbits.URXISEL
#define _TRMT U1STAbits.TRMT
#define _UTXBF U1STAbits.UTXBF
#define _UTXEN U1STAbits.UTXEN
#define _UTXBRK U1STAbits.UTXBRK
#define _UTXISEL0 U1STAbits.UTXISEL0
#define _UTXINV U1STAbits.UTXINV
#define _UTXISEL1 U1STAbits.UTXISEL1
#define _URXISEL0 U1STAbits.URXISEL0
#define _URXISEL1 U1STAbits.URXISEL1
#define _TXINV U1STAbits.TXINV

/* U2MODE */
/* Bitname _STSEL cannot be defined because it is used by more than one SFR */
/* Bitname _PDSEL cannot be defined because it is used by more than one SFR */
/* Bitname _BRGH cannot be defined because it is used by more than one SFR */
/* Bitname _URXINV cannot be defined because it is used by more than one SFR */
/* Bitname _ABAUD cannot be defined because it is used by more than one SFR */
/* Bitname _LPBACK cannot be defined because it is used by more than one SFR */
/* Bitname _WAKE cannot be defined because it is used by more than one SFR */
/* Bitname _UEN cannot be defined because it is used by more than one SFR */
/* Bitname _RTSMD cannot be defined because it is used by more than one SFR */
/* Bitname _IREN cannot be defined because it is used by more than one SFR */
/* Bitname _USIDL cannot be defined because it is used by more than one SFR */
/* Bitname _UARTEN cannot be defined because it is used by more than one SFR */
/* Bitname _PDSEL0 cannot be defined because it is used by more than one SFR */
/* Bitname _PDSEL1 cannot be defined because it is used by more than one SFR */
/* Bitname _RXINV cannot be defined because it is used by more than one SFR */
/* Bitname _UEN0 cannot be defined because it is used by more than one SFR */
/* Bitname _UEN1 cannot be defined because it is used by more than one SFR */

/* U2STA */
/* Bitname _URXDA cannot be defined because it is used by more than one SFR */
/* Bitname _OERR cannot be defined because it is used by more than one SFR */
/* Bitname _FERR cannot be defined because it is used by more than one SFR */
/* Bitname _PERR cannot be defined because it is used by more than one SFR */
/* Bitname _RIDLE cannot be defined because it is used by more than one SFR */
/* Bitname _ADDEN cannot be defined because it is used by more than one SFR */
/* Bitname _URXISEL cannot be defined because it is used by more than one SFR */
/* Bitname _TRMT cannot be defined because it is used by more than one SFR */
/* Bitname _UTXBF cannot be defined because it is used by more than one SFR */
/* Bitname _UTXEN cannot be defined because it is used by more than one SFR */
/* Bitname _UTXBRK cannot be defined because it is used by more than one SFR */
/* Bitname _UTXISEL0 cannot be defined because it is used by more than one SFR */
/* Bitname _UTXINV cannot be defined because it is used by more than one SFR */
/* Bitname _UTXISEL1 cannot be defined because it is used by more than one SFR */
/* Bitname _URXISEL0 cannot be defined because it is used by more than one SFR */
/* Bitname _URXISEL1 cannot be defined because it is used by more than one SFR */
/* Bitname _TXINV cannot be defined because it is used by more than one SFR */

/* SPI1STAT */
#define _SPIRBF SPI1STATbits.SPIRBF
#define _SPITBF SPI1STATbits.SPITBF
#define _SISEL SPI1STATbits.SISEL
#define _SRXMPT SPI1STATbits.SRXMPT
#define _SPIROV SPI1STATbits.SPIROV
#define _SRMPT SPI1STATbits.SRMPT
#define _SPIBEC SPI1STATbits.SPIBEC
#define _SPISIDL SPI1STATbits.SPISIDL
#define _SPIEN SPI1STATbits.SPIEN
#define _SISEL0 SPI1STATbits.SISEL0
#define _SISEL1 SPI1STATbits.SISEL1
#define _SISEL2 SPI1STATbits.SISEL2
#define _SPIBEC0 SPI1STATbits.SPIBEC0
#define _SPIBEC1 SPI1STATbits.SPIBEC1
#define _SPIBEC2 SPI1STATbits.SPIBEC2

/* SPI1CON1 */
#define _PPRE SPI1CON1bits.PPRE
#define _SPRE SPI1CON1bits.SPRE
#define _MSTEN SPI1CON1bits.MSTEN
#define _CKP SPI1CON1bits.CKP
#define _SSEN SPI1CON1bits.SSEN
#define _CKE SPI1CON1bits.CKE
#define _SMP SPI1CON1bits.SMP
#define _MODE16 SPI1CON1bits.MODE16
#define _DISSDO SPI1CON1bits.DISSDO
#define _DISSCK SPI1CON1bits.DISSCK
#define _PPRE0 SPI1CON1bits.PPRE0
#define _PPRE1 SPI1CON1bits.PPRE1
#define _SPRE0 SPI1CON1bits.SPRE0
#define _SPRE1 SPI1CON1bits.SPRE1
#define _SPRE2 SPI1CON1bits.SPRE2

/* SPI1CON2 */
#define _SPIBEN SPI1CON2bits.SPIBEN
#define _FRMDLY SPI1CON2bits.FRMDLY
#define _FRMPOL SPI1CON2bits.FRMPOL
#define _SPIFSD SPI1CON2bits.SPIFSD
#define _FRMEN SPI1CON2bits.FRMEN

/* SPI2STAT */
/* Bitname _SPIRBF cannot be defined because it is used by more than one SFR */
/* Bitname _SPITBF cannot be defined because it is used by more than one SFR */
/* Bitname _SISEL cannot be defined because it is used by more than one SFR */
/* Bitname _SRXMPT cannot be defined because it is used by more than one SFR */
/* Bitname _SPIROV cannot be defined because it is used by more than one SFR */
/* Bitname _SRMPT cannot be defined because it is used by more than one SFR */
/* Bitname _SPIBEC cannot be defined because it is used by more than one SFR */
/* Bitname _SPISIDL cannot be defined because it is used by more than one SFR */
/* Bitname _SPIEN cannot be defined because it is used by more than one SFR */
/* Bitname _SISEL0 cannot be defined because it is used by more than one SFR */
/* Bitname _SISEL1 cannot be defined because it is used by more than one SFR */
/* Bitname _SISEL2 cannot be defined because it is used by more than one SFR */
/* Bitname _SPIBEC0 cannot be defined because it is used by more than one SFR */
/* Bitname _SPIBEC1 cannot be defined because it is used by more than one SFR */
/* Bitname _SPIBEC2 cannot be defined because it is used by more than one SFR */

/* SPI2CON1 */
/* Bitname _PPRE cannot be defined because it is used by more than one SFR */
/* Bitname _SPRE cannot be defined because it is used by more than one SFR */
/* Bitname _MSTEN cannot be defined because it is used by more than one SFR */
/* Bitname _CKP cannot be defined because it is used by more than one SFR */
/* Bitname _SSEN cannot be defined because it is used by more than one SFR */
/* Bitname _CKE cannot be defined because it is used by more than one SFR */
/* Bitname _SMP cannot be defined because it is used by more than one SFR */
/* Bitname _MODE16 cannot be defined because it is used by more than one SFR */
/* Bitname _DISSDO cannot be defined because it is used by more than one SFR */
/* Bitname _DISSCK cannot be defined because it is used by more than one SFR */
/* Bitname _PPRE0 cannot be defined because it is used by more than one SFR */
/* Bitname _PPRE1 cannot be defined because it is used by more than one SFR */
/* Bitname _SPRE0 cannot be defined because it is used by more than one SFR */
/* Bitname _SPRE1 cannot be defined because it is used by more than one SFR */
/* Bitname _SPRE2 cannot be defined because it is used by more than one SFR */

/* SPI2CON2 */
/* Bitname _SPIBEN cannot be defined because it is used by more than one SFR */
/* Bitname _FRMDLY cannot be defined because it is used by more than one SFR */
/* Bitname _FRMPOL cannot be defined because it is used by more than one SFR */
/* Bitname _SPIFSD cannot be defined because it is used by more than one SFR */
/* Bitname _FRMEN cannot be defined because it is used by more than one SFR */

/* ADCON1L */
#define _ADSIDL ADCON1Lbits.ADSIDL
#define _ADON ADCON1Lbits.ADON

/* ADCON1H */
#define _SHRRES ADCON1Hbits.SHRRES
#define _FORM ADCON1Hbits.FORM
#define _SHRRES0 ADCON1Hbits.SHRRES0
#define _SHRRES1 ADCON1Hbits.SHRRES1

/* ADCON2L */
#define _SHRADCS ADCON2Lbits.SHRADCS
#define _SHREISEL ADCON2Lbits.SHREISEL
#define _EIEN ADCON2Lbits.EIEN
#define _REFERCIE ADCON2Lbits.REFERCIE
#define _REFCIE ADCON2Lbits.REFCIE
#define _SHRADCS0 ADCON2Lbits.SHRADCS0
#define _SHRADCS1 ADCON2Lbits.SHRADCS1
#define _SHRADCS2 ADCON2Lbits.SHRADCS2
#define _SHRADCS3 ADCON2Lbits.SHRADCS3
#define _SHRADCS4 ADCON2Lbits.SHRADCS4
#define _SHRADCS5 ADCON2Lbits.SHRADCS5
#define _SHRADCS6 ADCON2Lbits.SHRADCS6
#define _SHREISEL0 ADCON2Lbits.SHREISEL0
#define _SHREISEL1 ADCON2Lbits.SHREISEL1
#define _SHREISEL2 ADCON2Lbits.SHREISEL2

/* ADCON2H */
#define _SHRSAMC ADCON2Hbits.SHRSAMC
#define _REFERR ADCON2Hbits.REFERR
#define _REFRDY ADCON2Hbits.REFRDY
#define _SHRSAMC0 ADCON2Hbits.SHRSAMC0
#define _SHRSAMC1 ADCON2Hbits.SHRSAMC1
#define _SHRSAMC2 ADCON2Hbits.SHRSAMC2
#define _SHRSAMC3 ADCON2Hbits.SHRSAMC3
#define _SHRSAMC4 ADCON2Hbits.SHRSAMC4
#define _SHRSAMC5 ADCON2Hbits.SHRSAMC5
#define _SHRSAMC6 ADCON2Hbits.SHRSAMC6
#define _SHRSAMC7 ADCON2Hbits.SHRSAMC7
#define _SHRSAMC8 ADCON2Hbits.SHRSAMC8
#define _SHRSAMC9 ADCON2Hbits.SHRSAMC9

/* ADCON3L */
#define _CNVCHSEL ADCON3Lbits.CNVCHSEL
#define _SWCTRG ADCON3Lbits.SWCTRG
#define _SWLCTRG ADCON3Lbits.SWLCTRG
#define _CNVRTCH ADCON3Lbits.CNVRTCH
#define _SHRSAMP ADCON3Lbits.SHRSAMP
#define _SUSPRDY ADCON3Lbits.SUSPRDY
#define _SUSPCIE ADCON3Lbits.SUSPCIE
#define _SUSPEND ADCON3Lbits.SUSPEND
#define _REFSEL ADCON3Lbits.REFSEL
#define _CNVCHSEL0 ADCON3Lbits.CNVCHSEL0
#define _CNVCHSEL1 ADCON3Lbits.CNVCHSEL1
#define _CNVCHSEL2 ADCON3Lbits.CNVCHSEL2
#define _CNVCHSEL3 ADCON3Lbits.CNVCHSEL3
#define _CNVCHSEL4 ADCON3Lbits.CNVCHSEL4
#define _CNVCHSEL5 ADCON3Lbits.CNVCHSEL5
#define _REFSEL0 ADCON3Lbits.REFSEL0
#define _REFSEL1 ADCON3Lbits.REFSEL1
#define _REFSEL2 ADCON3Lbits.REFSEL2

/* ADCON3H */
#define _C0EN ADCON3Hbits.C0EN
#define _C1EN ADCON3Hbits.C1EN
#define _C2EN ADCON3Hbits.C2EN
#define _C3EN ADCON3Hbits.C3EN
#define _SHREN ADCON3Hbits.SHREN
#define _CLKDIV ADCON3Hbits.CLKDIV
#define _CLKSEL ADCON3Hbits.CLKSEL
#define _CLKDIV0 ADCON3Hbits.CLKDIV0
#define _CLKDIV1 ADCON3Hbits.CLKDIV1
#define _CLKDIV2 ADCON3Hbits.CLKDIV2
#define _CLKDIV3 ADCON3Hbits.CLKDIV3
#define _CLKDIV4 ADCON3Hbits.CLKDIV4
#define _CLKDIV5 ADCON3Hbits.CLKDIV5
#define _CLKSEL0 ADCON3Hbits.CLKSEL0
#define _CLKSEL1 ADCON3Hbits.CLKSEL1

/* ADCON4L */
#define _SAMC0EN ADCON4Lbits.SAMC0EN
#define _SAMC1EN ADCON4Lbits.SAMC1EN
#define _SAMC2EN ADCON4Lbits.SAMC2EN
#define _SAMC3EN ADCON4Lbits.SAMC3EN
#define _SYNCTRG0 ADCON4Lbits.SYNCTRG0
#define _SYNCTRG1 ADCON4Lbits.SYNCTRG1
#define _SYNCTRG2 ADCON4Lbits.SYNCTRG2
#define _SYNCTRG3 ADCON4Lbits.SYNCTRG3

/* ADCON4H */
#define _C0CHS ADCON4Hbits.C0CHS
#define _C1CHS ADCON4Hbits.C1CHS
#define _C2CHS ADCON4Hbits.C2CHS
#define _C3CHS ADCON4Hbits.C3CHS
#define _C0CHS0 ADCON4Hbits.C0CHS0
#define _C0CHS1 ADCON4Hbits.C0CHS1
#define _C1CHS0 ADCON4Hbits.C1CHS0
#define _C1CHS1 ADCON4Hbits.C1CHS1
#define _C2CHS0 ADCON4Hbits.C2CHS0
#define _C2CHS1 ADCON4Hbits.C2CHS1
#define _C3CHS0 ADCON4Hbits.C3CHS0
#define _C3CHS1 ADCON4Hbits.C3CHS1

/* ADMOD0L */
#define _SIGN0 ADMOD0Lbits.SIGN0
#define _DIFF0 ADMOD0Lbits.DIFF0
#define _SIGN1 ADMOD0Lbits.SIGN1
#define _DIFF1 ADMOD0Lbits.DIFF1
#define _SIGN2 ADMOD0Lbits.SIGN2
#define _DIFF2 ADMOD0Lbits.DIFF2
#define _SIGN3 ADMOD0Lbits.SIGN3
#define _DIFF3 ADMOD0Lbits.DIFF3
#define _SIGN4 ADMOD0Lbits.SIGN4
#define _DIFF4 ADMOD0Lbits.DIFF4
#define _SIGN5 ADMOD0Lbits.SIGN5
#define _DIFF5 ADMOD0Lbits.DIFF5
#define _SIGN6 ADMOD0Lbits.SIGN6
#define _DIFF6 ADMOD0Lbits.DIFF6
#define _SIGN7 ADMOD0Lbits.SIGN7
#define _DIFF7 ADMOD0Lbits.DIFF7

/* ADMOD0H */
#define _SIGN8 ADMOD0Hbits.SIGN8
#define _DIFF8 ADMOD0Hbits.DIFF8
#define _SIGN9 ADMOD0Hbits.SIGN9
#define _DIFF9 ADMOD0Hbits.DIFF9
#define _SIGN10 ADMOD0Hbits.SIGN10
#define _DIFF10 ADMOD0Hbits.DIFF10
#define _SIGN11 ADMOD0Hbits.SIGN11
#define _DIFF11 ADMOD0Hbits.DIFF11
#define _SIGN12 ADMOD0Hbits.SIGN12
#define _DIFF12 ADMOD0Hbits.DIFF12
#define _SIGN13 ADMOD0Hbits.SIGN13
#define _DIFF13 ADMOD0Hbits.DIFF13
#define _SIGN14 ADMOD0Hbits.SIGN14
#define _DIFF14 ADMOD0Hbits.DIFF14
#define _SIGN15 ADMOD0Hbits.SIGN15
#define _DIFF15 ADMOD0Hbits.DIFF15

/* ADMOD1L */
#define _SIGN16 ADMOD1Lbits.SIGN16
#define _DIFF16 ADMOD1Lbits.DIFF16
#define _SIGN17 ADMOD1Lbits.SIGN17
#define _DIFF17 ADMOD1Lbits.DIFF17
#define _SIGN18 ADMOD1Lbits.SIGN18
#define _DIFF18 ADMOD1Lbits.DIFF18
#define _SIGN19 ADMOD1Lbits.SIGN19
#define _DIFF19 ADMOD1Lbits.DIFF19
#define _SIGN20 ADMOD1Lbits.SIGN20
#define _DIFF20 ADMOD1Lbits.DIFF20
#define _SIGN21 ADMOD1Lbits.SIGN21
#define _DIFF21 ADMOD1Lbits.DIFF21

/* ADIEL */
#define _IE0 ADIELbits.IE0
#define _IE1 ADIELbits.IE1
#define _IE2 ADIELbits.IE2
#define _IE3 ADIELbits.IE3
#define _IE4 ADIELbits.IE4
#define _IE5 ADIELbits.IE5
#define _IE6 ADIELbits.IE6
#define _IE7 ADIELbits.IE7
#define _IE8 ADIELbits.IE8
#define _IE9 ADIELbits.IE9
#define _IE10 ADIELbits.IE10
#define _IE11 ADIELbits.IE11
#define _IE12 ADIELbits.IE12
#define _IE13 ADIELbits.IE13
#define _IE14 ADIELbits.IE14
#define _IE15 ADIELbits.IE15

