MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33EP16GS506/mcu.h
#define _ADCORE3L_SAMC0_POSITION                 0x00000000
#define _ADCORE3L_SAMC0_MASK                     0x00000001
#define _ADCORE3L_SAMC0_LENGTH                   0x00000001

#define _ADCORE3L_SAMC1_POSITION                 0x00000001
#define _ADCORE3L_SAMC1_MASK                     0x00000002
#define _ADCORE3L_SAMC1_LENGTH                   0x00000001

#define _ADCORE3L_SAMC2_POSITION                 0x00000002
#define _ADCORE3L_SAMC2_MASK                     0x00000004
#define _ADCORE3L_SAMC2_LENGTH                   0x00000001

#define _ADCORE3L_SAMC3_POSITION                 0x00000003
#define _ADCORE3L_SAMC3_MASK                     0x00000008
#define _ADCORE3L_SAMC3_LENGTH                   0x00000001

#define _ADCORE3L_SAMC4_POSITION                 0x00000004
#define _ADCORE3L_SAMC4_MASK                     0x00000010
#define _ADCORE3L_SAMC4_LENGTH                   0x00000001

#define _ADCORE3L_SAMC5_POSITION                 0x00000005
#define _ADCORE3L_SAMC5_MASK                     0x00000020
#define _ADCORE3L_SAMC5_LENGTH                   0x00000001

#define _ADCORE3L_SAMC6_POSITION                 0x00000006
#define _ADCORE3L_SAMC6_MASK                     0x00000040
#define _ADCORE3L_SAMC6_LENGTH                   0x00000001

#define _ADCORE3L_SAMC7_POSITION                 0x00000007
#define _ADCORE3L_SAMC7_MASK                     0x00000080
#define _ADCORE3L_SAMC7_LENGTH                   0x00000001

#define _ADCORE3L_SAMC8_POSITION                 0x00000008
#define _ADCORE3L_SAMC8_MASK                     0x00000100
#define _ADCORE3L_SAMC8_LENGTH                   0x00000001

#define _ADCORE3L_SAMC9_POSITION                 0x00000009
#define _ADCORE3L_SAMC9_MASK                     0x00000200
#define _ADCORE3L_SAMC9_LENGTH                   0x00000001

#define _ADCORE3H_ADCS_POSITION                  0x00000000
#define _ADCORE3H_ADCS_MASK                      0x0000007F
#define _ADCORE3H_ADCS_LENGTH                    0x00000007

#define _ADCORE3H_RES_POSITION                   0x00000008
#define _ADCORE3H_RES_MASK                       0x00000300
#define _ADCORE3H_RES_LENGTH                     0x00000002

#define _ADCORE3H_EISEL_POSITION                 0x0000000A
#define _ADCORE3H_EISEL_MASK                     0x00001C00
#define _ADCORE3H_EISEL_LENGTH                   0x00000003

#define _ADCORE3H_ADCS0_POSITION                 0x00000000
#define _ADCORE3H_ADCS0_MASK                     0x00000001
#define _ADCORE3H_ADCS0_LENGTH                   0x00000001

#define _ADCORE3H_ADCS1_POSITION                 0x00000001
#define _ADCORE3H_ADCS1_MASK                     0x00000002
#define _ADCORE3H_ADCS1_LENGTH                   0x00000001

#define _ADCORE3H_ADCS2_POSITION                 0x00000002
#define _ADCORE3H_ADCS2_MASK                     0x00000004
#define _ADCORE3H_ADCS2_LENGTH                   0x00000001

#define _ADCORE3H_ADCS3_POSITION                 0x00000003
#define _ADCORE3H_ADCS3_MASK                     0x00000008
#define _ADCORE3H_ADCS3_LENGTH                   0x00000001

#define _ADCORE3H_ADCS4_POSITION                 0x00000004
#define _ADCORE3H_ADCS4_MASK                     0x00000010
#define _ADCORE3H_ADCS4_LENGTH                   0x00000001

#define _ADCORE3H_ADCS5_POSITION                 0x00000005
#define _ADCORE3H_ADCS5_MASK                     0x00000020
#define _ADCORE3H_ADCS5_LENGTH                   0x00000001

#define _ADCORE3H_ADCS6_POSITION                 0x00000006
#define _ADCORE3H_ADCS6_MASK                     0x00000040
#define _ADCORE3H_ADCS6_LENGTH                   0x00000001

#define _ADCORE3H_RES0_POSITION                  0x00000008
#define _ADCORE3H_RES0_MASK                      0x00000100
#define _ADCORE3H_RES0_LENGTH                    0x00000001

#define _ADCORE3H_RES1_POSITION                  0x00000009
#define _ADCORE3H_RES1_MASK                      0x00000200
#define _ADCORE3H_RES1_LENGTH                    0x00000001

#define _ADCORE3H_EISEL0_POSITION                0x0000000A
#define _ADCORE3H_EISEL0_MASK                    0x00000400
#define _ADCORE3H_EISEL0_LENGTH                  0x00000001

#define _ADCORE3H_EISEL1_POSITION                0x0000000B
#define _ADCORE3H_EISEL1_MASK                    0x00000800
#define _ADCORE3H_EISEL1_LENGTH                  0x00000001

#define _ADCORE3H_EISEL2_POSITION                0x0000000C
#define _ADCORE3H_EISEL2_MASK                    0x00001000
#define _ADCORE3H_EISEL2_LENGTH                  0x00000001

#define _ADEIEL_EIEN0_POSITION                   0x00000000
#define _ADEIEL_EIEN0_MASK                       0x00000001
#define _ADEIEL_EIEN0_LENGTH                     0x00000001

#define _ADEIEL_EIEN1_POSITION                   0x00000001
#define _ADEIEL_EIEN1_MASK                       0x00000002
#define _ADEIEL_EIEN1_LENGTH                     0x00000001

#define _ADEIEL_EIEN2_POSITION                   0x00000002
#define _ADEIEL_EIEN2_MASK                       0x00000004
#define _ADEIEL_EIEN2_LENGTH                     0x00000001

#define _ADEIEL_EIEN3_POSITION                   0x00000003
#define _ADEIEL_EIEN3_MASK                       0x00000008
#define _ADEIEL_EIEN3_LENGTH                     0x00000001

#define _ADEIEL_EIEN4_POSITION                   0x00000004
#define _ADEIEL_EIEN4_MASK                       0x00000010
#define _ADEIEL_EIEN4_LENGTH                     0x00000001

#define _ADEIEL_EIEN5_POSITION                   0x00000005
#define _ADEIEL_EIEN5_MASK                       0x00000020
#define _ADEIEL_EIEN5_LENGTH                     0x00000001

#define _ADEIEL_EIEN6_POSITION                   0x00000006
#define _ADEIEL_EIEN6_MASK                       0x00000040
#define _ADEIEL_EIEN6_LENGTH                     0x00000001

#define _ADEIEL_EIEN7_POSITION                   0x00000007
#define _ADEIEL_EIEN7_MASK                       0x00000080
#define _ADEIEL_EIEN7_LENGTH                     0x00000001

#define _ADEIEL_EIEN8_POSITION                   0x00000008
#define _ADEIEL_EIEN8_MASK                       0x00000100
#define _ADEIEL_EIEN8_LENGTH                     0x00000001

#define _ADEIEL_EIEN9_POSITION                   0x00000009
#define _ADEIEL_EIEN9_MASK                       0x00000200
#define _ADEIEL_EIEN9_LENGTH                     0x00000001

