MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33EP16GS506/mcu.h
#define _RPOR13_RP59R2_POSITION                  0x0000000A
#define _RPOR13_RP59R2_MASK                      0x00000400
#define _RPOR13_RP59R2_LENGTH                    0x00000001

#define _RPOR13_RP59R3_POSITION                  0x0000000B
#define _RPOR13_RP59R3_MASK                      0x00000800
#define _RPOR13_RP59R3_LENGTH                    0x00000001

#define _RPOR13_RP59R4_POSITION                  0x0000000C
#define _RPOR13_RP59R4_MASK                      0x00001000
#define _RPOR13_RP59R4_LENGTH                    0x00000001

#define _RPOR13_RP59R5_POSITION                  0x0000000D
#define _RPOR13_RP59R5_MASK                      0x00002000
#define _RPOR13_RP59R5_LENGTH                    0x00000001

#define _RPOR14_RP60R_POSITION                   0x00000000
#define _RPOR14_RP60R_MASK                       0x0000003F
#define _RPOR14_RP60R_LENGTH                     0x00000006

#define _RPOR14_RP61R_POSITION                   0x00000008
#define _RPOR14_RP61R_MASK                       0x00003F00
#define _RPOR14_RP61R_LENGTH                     0x00000006

#define _RPOR14_RP60R0_POSITION                  0x00000000
#define _RPOR14_RP60R0_MASK                      0x00000001
#define _RPOR14_RP60R0_LENGTH                    0x00000001

#define _RPOR14_RP60R1_POSITION                  0x00000001
#define _RPOR14_RP60R1_MASK                      0x00000002
#define _RPOR14_RP60R1_LENGTH                    0x00000001

#define _RPOR14_RP60R2_POSITION                  0x00000002
#define _RPOR14_RP60R2_MASK                      0x00000004
#define _RPOR14_RP60R2_LENGTH                    0x00000001

#define _RPOR14_RP60R3_POSITION                  0x00000003
#define _RPOR14_RP60R3_MASK                      0x00000008
#define _RPOR14_RP60R3_LENGTH                    0x00000001

#define _RPOR14_RP60R4_POSITION                  0x00000004
#define _RPOR14_RP60R4_MASK                      0x00000010
#define _RPOR14_RP60R4_LENGTH                    0x00000001

#define _RPOR14_RP60R5_POSITION                  0x00000005
#define _RPOR14_RP60R5_MASK                      0x00000020
#define _RPOR14_RP60R5_LENGTH                    0x00000001

#define _RPOR14_RP61R0_POSITION                  0x00000008
#define _RPOR14_RP61R0_MASK                      0x00000100
#define _RPOR14_RP61R0_LENGTH                    0x00000001

#define _RPOR14_RP61R1_POSITION                  0x00000009
#define _RPOR14_RP61R1_MASK                      0x00000200
#define _RPOR14_RP61R1_LENGTH                    0x00000001

#define _RPOR14_RP61R2_POSITION                  0x0000000A
#define _RPOR14_RP61R2_MASK                      0x00000400
#define _RPOR14_RP61R2_LENGTH                    0x00000001

#define _RPOR14_RP61R3_POSITION                  0x0000000B
#define _RPOR14_RP61R3_MASK                      0x00000800
#define _RPOR14_RP61R3_LENGTH                    0x00000001

#define _RPOR14_RP61R4_POSITION                  0x0000000C
#define _RPOR14_RP61R4_MASK                      0x00001000
#define _RPOR14_RP61R4_LENGTH                    0x00000001

#define _RPOR14_RP61R5_POSITION                  0x0000000D
#define _RPOR14_RP61R5_MASK                      0x00002000
#define _RPOR14_RP61R5_LENGTH                    0x00000001

#define _RPOR15_RP62R_POSITION                   0x00000000
#define _RPOR15_RP62R_MASK                       0x0000003F
#define _RPOR15_RP62R_LENGTH                     0x00000006

#define _RPOR15_RP63R_POSITION                   0x00000008
#define _RPOR15_RP63R_MASK                       0x00003F00
#define _RPOR15_RP63R_LENGTH                     0x00000006

#define _RPOR15_RP62R0_POSITION                  0x00000000
#define _RPOR15_RP62R0_MASK                      0x00000001
#define _RPOR15_RP62R0_LENGTH                    0x00000001

#define _RPOR15_RP62R1_POSITION                  0x00000001
#define _RPOR15_RP62R1_MASK                      0x00000002
#define _RPOR15_RP62R1_LENGTH                    0x00000001

#define _RPOR15_RP62R2_POSITION                  0x00000002
#define _RPOR15_RP62R2_MASK                      0x00000004
#define _RPOR15_RP62R2_LENGTH                    0x00000001

#define _RPOR15_RP62R3_POSITION                  0x00000003
#define _RPOR15_RP62R3_MASK                      0x00000008
#define _RPOR15_RP62R3_LENGTH                    0x00000001

#define _RPOR15_RP62R4_POSITION                  0x00000004
#define _RPOR15_RP62R4_MASK                      0x00000010
#define _RPOR15_RP62R4_LENGTH                    0x00000001

#define _RPOR15_RP62R5_POSITION                  0x00000005
#define _RPOR15_RP62R5_MASK                      0x00000020
#define _RPOR15_RP62R5_LENGTH                    0x00000001

#define _RPOR15_RP63R0_POSITION                  0x00000008
#define _RPOR15_RP63R0_MASK                      0x00000100
#define _RPOR15_RP63R0_LENGTH                    0x00000001

#define _RPOR15_RP63R1_POSITION                  0x00000009
#define _RPOR15_RP63R1_MASK                      0x00000200
#define _RPOR15_RP63R1_LENGTH                    0x00000001

#define _RPOR15_RP63R2_POSITION                  0x0000000A
#define _RPOR15_RP63R2_MASK                      0x00000400
#define _RPOR15_RP63R2_LENGTH                    0x00000001

#define _RPOR15_RP63R3_POSITION                  0x0000000B
#define _RPOR15_RP63R3_MASK                      0x00000800
#define _RPOR15_RP63R3_LENGTH                    0x00000001

#define _RPOR15_RP63R4_POSITION                  0x0000000C
#define _RPOR15_RP63R4_MASK                      0x00001000
#define _RPOR15_RP63R4_LENGTH                    0x00000001

#define _RPOR15_RP63R5_POSITION                  0x0000000D
#define _RPOR15_RP63R5_MASK                      0x00002000
#define _RPOR15_RP63R5_LENGTH                    0x00000001

#define _RPOR16_RP176R_POSITION                  0x00000000
#define _RPOR16_RP176R_MASK                      0x0000003F
#define _RPOR16_RP176R_LENGTH                    0x00000006

#define _RPOR16_RP177R_POSITION                  0x00000008
#define _RPOR16_RP177R_MASK                      0x00003F00
#define _RPOR16_RP177R_LENGTH                    0x00000006

