MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33EP16GS506/mcu.h
/*
 * Flash Programming Information
 */

#undef _FLASH_PAGE
#define _FLASH_PAGE 0x200

#undef _FLASH_ROW
#define _FLASH_ROW 0x40

/*
 * Memory Segments Sizes
 */

#define __AIVT_BASE 0x0
#define __AIVT_LENGTH 0x200

#define __RESET_BASE 0x0
#define __RESET_LENGTH 0x4

#define __IVT_BASE 0x4
#define __IVT_LENGTH 0x1fc

#define __PROGRAM_BASE 0x200
#define __PROGRAM_LENGTH 0x2980

#define __FSEC_BASE 0x2b80
#define __FSEC_LENGTH 0x2

#define __FBSLIM_BASE 0x2b90
#define __FBSLIM_LENGTH 0x2

#define __FSIGN_BASE 0x2b94
#define __FSIGN_LENGTH 0x2

#define __FOSCSEL_BASE 0x2b98
#define __FOSCSEL_LENGTH 0x2

#define __FOSC_BASE 0x2b9c
#define __FOSC_LENGTH 0x2

#define __FWDT_BASE 0x2ba0
#define __FWDT_LENGTH 0x2

#define __FPOR_BASE 0x2ba4
#define __FPOR_LENGTH 0x2

#define __FICD_BASE 0x2ba8
#define __FICD_LENGTH 0x2

#define __FDEVOPT_BASE 0x2bac
#define __FDEVOPT_LENGTH 0x2

#define __FALTREG_BASE 0x2bb0
#define __FALTREG_LENGTH 0x2

#define __PGA1CAL_BASE 0x800e48
#define __PGA1CAL_LENGTH 0x2

#define __PGA2CAL_BASE 0x800e4c
#define __PGA2CAL_LENGTH 0x2

#define __ISRCCAL_BASE 0x800e78
#define __ISRCCAL_LENGTH 0x2

#define __DEVID_BASE 0xff0000
#define __DEVID_LENGTH 0x4

#define __SFRS_BASE 0x0
#define __SFRS_LENGTH 0x1000

#define __DATA_BASE 0x1000
#define __DATA_LENGTH 0x800

#define __YDATA_BASE 0x1400
#define __YDATA_LENGTH 0x1400
#define __SFRS_BASE 0x0
#define __SFRS_LENGTH 0x1000

#define __DATA_BASE 0x1000
#define __DATA_LENGTH 0x800

#define __YDATA_BASE 0x1400
#define __YDATA_LENGTH 0x1400
#define __SFRS_BASE 0x0
#define __SFRS_LENGTH 0x1000

#define __DATA_BASE 0x1000
#define __DATA_LENGTH 0x800

#define __YDATA_BASE 0x1400
#define __YDATA_LENGTH 0x1400

/*
 * PPS Remapping Pin Names
 */

#define _RPOUT_U1TX 1
#define _RPOUT_U1RTS 2
#define _RPOUT_U2TX 3
#define _RPOUT_U2RTS 4
#define _RPOUT_SDO1 5
#define _RPOUT_SCK1 6
#define _RPOUT_SS1 7
#define _RPOUT_SDO2 8
#define _RPOUT_SCK2 9
#define _RPOUT_SS2 10
#define _RPOUT_OC1 16
#define _RPOUT_OC2 17
#define _RPOUT_OC3 18
#define _RPOUT_OC4 19
#define _RPOUT_ACMP1 24
#define _RPOUT_ACMP2 25
#define _RPOUT_ACMP3 26
#define _RPOUT_SYNCO1 45
#define _RPOUT_SYNCO2 46
#define _RPOUT_REFCLKO 49
#define _RPOUT_ACMP4 50

#endif
